#src/constants/texts.py
answer1:str = '''Помогу поступить в выбранный вуз, сдать ЕГЭ, ОГЭ, контрольную или подтянуть успеваемость.

Выпускник Физического факультета МГУ и 57-й школы.
Опыт подготовки школьников к поступлению - 20 лет.
Благодаря нашим занятиям, дети сдают ЕГЭ по физике и математике на 60-96 баллов. 
После этого, поступают в МГУ, МГТУ, ВШЭ, РГУ нефти и газа им.Губкина, ...,  а так же в американские, английские, и другие вузы.

Начальный уровень не важен. Готов помочь школьникам с нулевыми знаниями, но с желанием,
и отличникам, которые хотят уверенно поступить или поступить по олимпиаде. Олимпиада "Шаг в будущее" МГТУ им. Баумана дает 100 баллов на ЕГЭ, при поступлении туда же.

За 2 года занятий ребенок поступит в МГУ ил другой вуз, даже с нулевого уровня, при условии желания и если делает домашние задания. Выполнение домашней работы - 70% результата.
За 1 год ребенок на 30-60 балов поднимет результат ЕГЭ. При изначально нулевом уровне, наберет 60-75 баллов.
За пол года поднимет уровень на 20-40 баллов.
За 3 месяца на 10-20 баллов.
За 1-2 месяца, подготовим с нуля до такого уровня, что ребенок сдаст базовый ЕГЭ по математике или профильный, если из базы делает больше половины. Для физики нужно хотя бы пол года, если начинать с нуля. Одному ученику потребовалось 2 занятия, что бы сдать с нуля.

Подготовка к ОГЭ проходит быстрее, тут и за год и за пол года с нуля подготовимся и сдадим.

До лета есть возможность преподавать только дистанционно.
Дистанционные занятия стоят 5000 р. - 60 мин или 6000 р. - 90 мин. Для таких занятий нужно или направить камеру на тетрадь ребенка или оперативно присылать фотографии тетради во время занятий, или воспользоваться недорогим планшетом для рисования или iPad.
Оплата за одно занятие или за месяц вперед.

На первом занятии мы решим вариант ЕГЭ. После него вы узнаете какой уровень у ребенка и где слабые места. Так же, получите рекомендации по дальнейшей подготовке.'''

predistoriya :str = "Далее представлен текст моего стандартного ответа на заяявку клиента (меня зовут Владимир Подлевских):"

pro_clienta :str = "Твоя задача переписать этот ответ, сделать его персонализированным, что бы он подходил для клиента с такой информацией (указанную дальше цену не учитывать при формировании ответа):"

instrukcii :str = "Основные инструкции: пиши без особой фантазии, главное что бы осталась нетронута вся цифровая информация, передано все важное из моего запроса, и что бы запрос был релятивен информации клиента, если нужны дополнительные языки знаю только английский и русский, С уважением в конце добавлять не нужно. В именах ошибаться нельзя. Пиши как человек. Я занимаюсь сейчас Только дистанционно."

